CourseDetails.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xro="http://x-road.eu/xsd/xroad.xsd" xmlns:iden="http://x-road.eu/xsd/identifiers" xmlns:tra="http://trainings.ttu.ee">
   <soapenv:Header>
      <xro:protocolVersion>4.0</xro:protocolVersion>
      <xro:id>v${=java.util.UUID.randomUUID()}</xro:id>
      <xro:userId>EE234234234</xro:userId>
      <xro:service iden:objectType="SERVICE">
         <iden:xRoadInstance>ee-dev</iden:xRoadInstance>
         <iden:memberClass>COM</iden:memberClass>
         <iden:memberCode>11333578</iden:memberCode>
         <!--Optional:-->
         <iden:subsystemCode>DEVTRAINING_09_A</iden:subsystemCode>
         <iden:serviceCode>CourseDetails</iden:serviceCode>
         <!--Optional:-->
         <iden:serviceVersion>v1</iden:serviceVersion>
      </xro:service>
      <xro:client iden:objectType="SUBSYSTEM">
         <iden:xRoadInstance>ee-dev</iden:xRoadInstance>
         <iden:memberClass>COM</iden:memberClass>
         <iden:memberCode>11333578</iden:memberCode>
         <!--Optional:-->
         <iden:subsystemCode>DEVTRAINING_09_B</iden:subsystemCode>
      </xro:client>
   </soapenv:Header>
   <soapenv:Body>
      <tra:CourseDetails>
         <Id>2</Id>
      </tra:CourseDetails>
   </soapenv:Body>
</soapenv:Envelope>